In [13]:
import requests
import json
import os
import csv
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
from pprint import pprint
from config import api_key

pd.options.display.float_format = "{:,.2f}".format

allmovies_df = pd.read_csv("allmoviesdata.csv")
allmovies_df["Director"] = allmovies_df["Director"].astype('string')
allmovies_df

,Movie ID,Rank,Title,Production Budget,Domestic Gross,Worldwide Gross,Main Genre,2nd Genre,3rd Genre,IMDB Rating,Studio,Year,IMDb ID,Director
0,0,48,Black Panther,"200,000,000.00","700,059,566.00","1,336,494,320.00",Action,Adventure,Drama,7.40,Walt Disney Pictures,2018,NaN,Ryan Coogler
1,1,5,Avengers: Infinity War,"300,000,000.00","678,815,482.00","2,048,359,754.00",Action,Adventure,Sci-Fi,8.50,Walt Disney Pictures,2018,NaN,"Anthony Russo, Joe Russo"
2,2,50,Incredibles 2,"200,000,000.00","608,581,744.00","1,242,805,359.00",Animation,Action,Adventure,7.80,Pixar,2018,NaN,Brad Bird
3,3,144,Jurassic World: Fallen Kingdom,"170,000,000.00","417,719,760.00","1,308,323,302.00",Action,Adventure,Drama,6.20,Universal Pictures,2018,NaN,J.A. Bayona
4,4,11,Solo: A Star Wars Story,"275,000,000.00","213,767,512.00","393,151,347.00",Action,Adventure,Drama,7.00,Walt Disney Pictures,2018,NaN,Ron Howard
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
216,204,"4,918",Annie Hall,"4,000,000.00","38,251,425.00","38,251,425.00",Romance,Drama,Comedy,8.10,Metro-Goldwyn-Mayer,1977,tt0075686,Woody Allen
217,205,"2,387",The Omen,"25,000,000.00","54,607,383.00","119,295,584.00",Thriller,Horror,Drama,7.60,20th Century Fox,1976,tt0075005,Richard Donner
218,206,44,King Kong,"207,000,000.00","218,080,025.00","550,517,357.00",Horror,Fantasy,Adventure,5.80,Paramount Pictures,1976,tt0074751,John Guillermin
219,207,445,Midway,"100,000,000.00","56,846,802.00","126,815,030.00",History,Drama,Action,6.70,Universal Pictures,1976,tt0074899,Jack Smight
220,208,"4,676",The Return of the Pink Panther,"5,000,000.00","41,833,347.00","41,833,347.00",Thriller,Crime,Comedy,7.10,Metro-Goldwyn-Mayer,1975,tt0072081,Blake Edwards

In [14]:
allmovies_df.drop(['Main Genre','2nd Genre','3rd Genre','IMDB Rating','Studio','Year','IMDb ID','Director'], axis=1, inplace=True)
allmovies_df

,Movie ID,Rank,Title,Production Budget,Domestic Gross,Worldwide Gross
0,0,48,Black Panther,"200,000,000.00","700,059,566.00","1,336,494,320.00"
1,1,5,Avengers: Infinity War,"300,000,000.00","678,815,482.00","2,048,359,754.00"
2,2,50,Incredibles 2,"200,000,000.00","608,581,744.00","1,242,805,359.00"
3,3,144,Jurassic World: Fallen Kingdom,"170,000,000.00","417,719,760.00","1,308,323,302.00"
4,4,11,Solo: A Star Wars Story,"275,000,000.00","213,767,512.00","393,151,347.00"
...,...,...,...,...,...,...
216,204,"4,918",Annie Hall,"4,000,000.00","38,251,425.00","38,251,425.00"
217,205,"2,387",The Omen,"25,000,000.00","54,607,383.00","119,295,584.00"
218,206,44,King Kong,"207,000,000.00","218,080,025.00","550,517,357.00"
219,207,445,Midway,"100,000,000.00","56,846,802.00","126,815,030.00"
220,208,"4,676",The Return of the Pink Panther,"5,000,000.00","41,833,347.00","41,833,347.00"

In [3]:
production_bud_df = allmovies_df[["Production Budget"]]
production_bud_df.head()

   Production Budget
0     200,000,000.00
1     300,000,000.00
2     200,000,000.00
3     170,000,000.00
4     275,000,000.00

In [4]:
domestic_gross_df = allmovies_df[["Domestic Gross"]]
domestic_gross_df.head()

   Domestic Gross
0  700,059,566.00
1  678,815,482.00
2  608,581,744.00
3  417,719,760.00
4  213,767,512.00

In [5]:
worldwide_gross_df = allmovies_df[["Worldwide Gross"]]
worldwide_gross_df.head()

   Worldwide Gross
0 1,336,494,320.00
1 2,048,359,754.00
2 1,242,805,359.00
3 1,308,323,302.00
4   393,151,347.00